In [1]:
import pandas

In [2]:
names=["Tom치s", "Pauline", "Pablo", "Bjork","Alan","Juana"]
woman=[False,True,False,False,False,True]
ages=[32,33,28,30,32,27]
country=["Chile", "Senegal", "Spain", "Norway","Peru","Peru"]
education=["Bach", "Bach", "Master", "PhD","Bach","Master"]

In [3]:
data={'Names':names, 'Woman':woman, 'Ages':ages, 'Country': country, 'Education': education}
data

{'Names': ['Tom치s', 'Pauline', 'Pablo', 'Bjork', 'Alan', 'Juana'],
 'Woman': [False, True, False, False, False, True],
 'Ages': [32, 33, 28, 30, 32, 27],
 'Country': ['Chile', 'Senegal', 'Spain', 'Norway', 'Peru', 'Peru'],
 'Education': ['Bach', 'Bach', 'Master', 'PhD', 'Bach', 'Master']}

In [4]:
friends=pandas.DataFrame.from_dict(data)
friends

     Names  Woman  Ages  Country Education
0    Tom치s  False    32    Chile      Bach
1  Pauline   True    33  Senegal      Bach
2    Pablo  False    28    Spain    Master
3    Bjork  False    30   Norway       PhD
4     Alan  False    32     Peru      Bach
5    Juana   True    27     Peru    Master

In [19]:
#Where is the youngest male in the group from? #sort_values()
friends[friends.Woman==False].sort_values('Ages',ascending=False).tail(1).Country

2    Spain
Name: Country, dtype: object

In [107]:
#Where is the youngest male in the group from? #where() and min()
s = friends.Woman
s.where(friends.Woman==False, friends['Ages'].min()) 
#I have tried many different combinations to try to figure out how to add conditions for Ages and Country, but I cannot do so without consistently getting error reports)
#When I use friends['Ages'].min(), it keeps spitting out 27 which is the youngest for the female, not the males. All the research I came across could only guide in changing values in tables, not producing a single response.

0    False
1       27
2    False
3    False
4    False
5       27
Name: Woman, dtype: object

In [75]:
#I did this to practice min() because I cannot figure out where()
friends['Ages'].min()

27

In [110]:
#Where is the youngest male in the group from? #query() and min()
from numpy.random import randn
from pandas import friends
friends(randn(False)), columns=list('Ages')
df.query('Ages')

SyntaxError: can't assign to function call (<ipython-input-110-cdca945c8963>, line 4)